# Дана сторона квадрата a. Найти его площадь S = a²
# Примечание: сторону квадрата получаем через функцию input().
# При решении задачи обратите внимание какой тип вы получаете через функцию input().

x1=input("Введите значение стороны квадрата: \n")

a = float(x1)
print(f"S={a}^2={a**2}")